In [2]:
import pandas as pd

In [4]:
data = {
    'Varsh':[2003,28,6],
    'Varsha':[2002,9,27]
}
df = pd.DataFrame(data)

In [6]:
df.head()

   Varsh  Varsha
0   2003    2002
1     28       9
2      6      27

In [7]:
calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)

print(myvar)

day1    420
day2    380
day3    390
dtype: int64

## row wise extraction

In [10]:
df.loc[0]

Varsh     2003
Varsha    2002
Name: 0, dtype: int64

In [11]:
df.loc[[0,1]]

   Varsh  Varsha
0   2003    2002
1     28       9

In [12]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

In [13]:
df.head()

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [17]:
df = pd.read_csv('data.csv')
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [18]:
df.isnull().sum()

Duration    0
Date        1
Pulse       0
Maxpulse    0
Calories    2
dtype: int64

In [22]:
x = df.Calories.mean #median
df['Calories'].fillna(x,inplace = True)
df.isnull().sum()

Duration    0
Date        1
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [24]:
df.dropna(inplace = True)
df.isnull().sum()

Duration    0
Date        0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [25]:
df.dropna(subset=['Date'], inplace = True)

In [ ]:
'''Wrong Data
"Wrong data" does not have to be "empty cells" or "wrong format", it can just be wrong, like if someone registered "199" instead of "1.99".

Sometimes you can spot wrong data by looking at the data set, because you have an expectation of what it should be.

If you take a look at our data set, you can see that in row 7, the duration is 450, but for all the other rows the duration is between 30 and 60.

It doesn't have to be wrong, but taking in consideration that this is the data set of someone's workout sessions, we conclude with the fact that this person did not work out in 450 minutes.'''

In [26]:
df.loc[7, 'Duration'] = 45

In [27]:
for x in df.index:
  if df.loc[x, "Duration"] > 120:
    df.drop(x, inplace = True)

In [28]:
df.drop_duplicates(inplace = True)